Page({
  data: {
    faqList: [
      {
        question: "药物如何口服？",
        answer: `①盐酸羟考酮缓释片，12小时服用1次，剂量需与医生联系。
②吗啡片，12小时服用1次，或者6小时服用1次，剂量需与医生联系。
③氨酚羟考酮片，8小时服用1次，或者6小时服用1次，剂量需与医生联系。
④布洛芬，根据说明书进行服用。`
      },
      {
        question: "长期服用止痛药，如何预防和处理药物副作用？",
        answer: `预防药物副作用的关键在于合理选择药物、严格控制剂量以及密切监测患者的反应。在使用止痛药前，要充分了解药物的常见副作用，并向患者及家属进行详细说明，让他们能够及时发现异常情况。对于已经出现的副作用，如恶心、呕吐、便秘，可以采取相应的对症治疗措施，如使用止吐药、缓泻剂等。同时，要定期对患者进行全面的身体检查，包括血常规、肝肾功能等，以便及时发现潜在的严重副作用并采取相应的处理措施。`
      },
      {
        question: "发生便秘，怎么办？",
        answer: `首先，可以通过调整饮食结构，增加膳食纤维的摄入（如多吃蔬菜、水果、粗粮等），多喝水，适当增加活动量来缓解便秘。如果饮食和生活方式调整效果不明显，可以使用一些缓泻剂，如乳果糖、麻仁润肠丸等。在使用缓泻剂时，也要注意观察大便情况和身体反应，避免过度使用导致腹泻等其他问题。如果便秘情况严重或持续时间较长，需要及时告知医生，医生可能会调整药物剂量或更换其他类型的止痛药物。`
      },
      {
        question: "发生恶心、呕吐，怎么办？",
        answer: `出现恶心呕吐时，可采取药物和非药物治疗措施。药物治疗包括使用甲氧氯普胺、地塞米松、5-羟色胺受体拮抗剂（如格拉司琼或昂丹司琼）、奥氮平及其他胃动力药（如多潘立酮），以预防或缓解症状。非药物治疗方面，建议提供心理支持、分散注意力（如听音乐、看电影等）、调整饮食（清淡易消化食物，少食多餐）以及生活方式调整（保持良好作息、适当活动）。对于持续性恶心呕吐或严重影响生活质量的患者，应重新评估并调整治疗方案，可能需要更换其他阿片类药物或联合使用不同机制的药物。`
      },
      {
        question: "患者是否可以根据自己的疼痛情况自行调整止痛药物的剂量？",
        answer: `一般情况下，患者不建议自行调整止痛药物的剂量。止痛药物的使用剂量是根据患者的病情、疼痛程度、身体状况以及药物的特性等因素综合确定的，随意调整剂量可能会导致疼痛控制不佳或增加药物副作用的风险。如果患者感觉疼痛控制效果不理想或出现药物副作用，应及时与医生沟通，由医生根据具体情况调整治疗方案，包括调整药物剂量、更换药物种类或增加其他辅助治疗措施等。`
      },
      {
        question: "如果患者正在服用其他疾病治疗药物，会不会与癌痛止痛药产生相互作用？",
        answer: `有可能。许多药物之间都可能存在相互作用，影响药物的疗效或增加副作用的风险。在服用其他疾病治疗药物的同时使用癌痛止痛药时，一定要告知医生所有正在使用的药物（包括处方药、非处方药、保健品等），医生会根据具体情况评估药物相互作用的风险，并选择合适的止痛药物或调整药物剂量。`
      },
      {
        question: "癌痛会不会随着时间的推移越来越难以忍受？",
        answer: `癌痛的发展情况因个体差异和病情不同而有所差异。随着病情进展，疼痛可能会有所变化，但通过及时调整治疗方案，包括优化止痛药物的种类、剂量，以及结合其他辅助治疗手段，通常可以有效控制疼痛，避免其变得难以忍受。所以，一定要密切关注疼痛变化，并及时与医生沟通调整治疗方案。`
      }
      // 可以继续添加更多问题与解答
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) { },

});